{
    "123456": {
        "record-1": {
            "plant name": "grape",
            "date": "Oct. 26th",
            "note": "beautiful grape growing well today :)",
            "story1": "",
            "story2": "",
            "emoji": "👍"
        },
        "record-2": {
            "plant name": "carrot",
            "date": "Oct. 27th",
            "note": "I harvested the carrots today",
            "story1": "If you want to plant carrots in your own backyard, there are a few things to keep in mind. First, choose a sunny spot with well-drained soil that is free of weeds and rocks. Carrots need plenty of sunlight and water to grow, so make sure to water them regularly and provide them with enough light. Before planting, till the soil to a depth of at least six inches to allow the carrots to grow deep roots. Then, plant your carrot seeds about an inch deep and two inches apart, in rows that are about a foot apart. Once your carrot seeds have sprouted and the seedlings are about two inches tall, thin them out to one plant every four inches. This will give the remaining carrots room to grow and develop.",
            "story2": "As your carrots grow, keep an eye out for pests and weeds. Carrots are susceptible to root maggots and other pests, so check your plants regularly and remove any pests you find. Weeds can also compete with your carrots for resources, so be sure to keep your garden weed-free. Finally, when your carrots are ready to harvest, carefully pull them from the ground and wash them off before enjoying them fresh from the garden. With a little care and attention, you can grow delicious carrots right in your own backyard.",
            "emoji": "😄"
        },
        "record-3": {
            "plant name": "tomato",
            "date": "Oct. 30th",
            "note": "The tomatoes look nice, I want to plate them with fried eggs ><",
            "story1": "Tomato is best served with fried egg. I love the combination of tomato and fried egg. Here is how to make it. First, you need to fry the egg. Then, you need to cut the tomato into small pieces. Finally, you need to put the tomato and fried egg together. It is very easy to make. You can try it at home.",
            "story2": "Here are some tips for you. First, you need to make sure the tomato is ripe. Second, you need to make sure the egg is fresh. Third, you need to make sure the oil is hot enough. Fourth, you need to make sure the tomato is cut into small pieces. Fifth, you need to make sure the fried egg is not too hard. Sixth, you need to make sure the fried egg is not too soft. Seventh, you need to make sure the fried egg is not too salty. Eighth, you need to make sure the fried egg is not too sweet. Ninth, you need to make sure the fried egg is not too spicy. ",
            "emoji": "🎉"
        },
        "record-4": {
            "plant name": "apple",
            "date": "Nov. 14th",
            "note": "it smells a very good!",
            "story1": "Apple is my favorite fruit. Apples are suitable for people of all ages. They are rich in vitamin C and vitamin B6. They are also rich in fiber, folate, and potassium. Apples are also good for your heart. They can help lower your blood pressure and cholesterol. Apples are also good for your eyes. They can help prevent cataracts and macular degeneration. Apples are also good for your skin. They can help prevent acne and wrinkles. Apples are also good for your immune system.",
            "story2": "I grow apple with love. An apple a day keeps the doctor away. I eat apple with peanut butter. I started to like gardening because of apple. I think growing my own apple is more interesting than going to apple picking. There are different types of apple. Some of the most common types of apple are Gala, Fuji, and Granny Smith. Gala is the most common type of apple. It is red, yellow, or green. It is round, oblong, or bell-shaped. It is mild, medium, or hot. ",
            "emoji": "😍"
        },
        "record-5": {
            "plant name": "lemon",
            "date": "Dec. 11th",
            "note": "rainy day makes lemon grow slowly",
            "story1": "Lemon is very special to me. I like to eat lemon with some yogurt. Lemon is good for your health. It is rich in vitamin C and vitamin B6. It is also rich in fiber, folate, and potassium. Lemon is good for your heart. It can help lower your blood pressure and cholesterol. Lemon is good for your eyes. It can help prevent cataracts and macular degeneration. Lemon is good for your skin. It can help prevent acne and wrinkles. Lemon is good for your immune system. ",
            "story2": "Lemon are good for beginners. Lemon are easy to grow. You need a lot of water and sunlight. You also need a lot of space. You can grow lemon in your garden or in a pot. You can also grow lemon in a greenhouse. You can grow lemon in a greenhouse if you live in a cold climate. You can grow lemon in a greenhouse if you live in a warm climate. You can grow lemon in a greenhouse if you live in a hot climate. You can grow lemon in a greenhouse if you live in a dry climate. You can grow lemon in a greenhouse if you live in a wet climate.  ",
            "emoji": "🫡"
        },
        "record-6": {
            "plant name": "tomato",
            "date": "Oct. 30th",
            "note": "The tomatoes look nice, I want to plate them with fried eggs ><",
            "story1": "Tomato is best served with fried egg. I love the combination of tomato and fried egg. Here is how to make it. First, you need to fry the egg. Then, you need to cut the tomato into small pieces. Finally, you need to put the tomato and fried egg together. It is very easy to make. You can try it at home.",
            "story2": "Growing tomato is not that hard. You just need to water them regularly and provide them with enough light. Before planting, till the soil to a depth of at least six inches to allow the tomatoes to grow deep roots. Then, plant your tomato seeds about an inch deep and two inches apart, in rows that are about a foot apart. Once your tomato seeds have sprouted and the seedlings are about two inches tall, thin them out to one plant every four inches. This will give the remaining tomatoes room to grow and develop.",
            "emoji": "🎉"
        }
    },
    "234567": {
        "record-1": {
            "plant name": "onion",
            "date": "Nov. 23th",
            "note": "need to increase moisture to 50% next time",
            "story1": "Onions are good for your health. They are rich in vitamin C and vitamin B6. They are also rich in fiber, folate, and potassium. Onions are also good for your heart. They can help lower your blood pressure and cholesterol. Onions are also good for your eyes. They can help prevent cataracts and macular degeneration. Onions are also good for your skin. They can help prevent acne and wrinkles. Onions are also good for your immune system. ",
            "story2": "Onions are tricky to grow. They need a lot of water and sunlight. They also need a lot of space. You can grow onions in your garden or in a pot. You can also grow onions in a greenhouse. You can grow onions in a greenhouse if you live in a cold climate. You can grow onions in a greenhouse if you live in a warm climate. You can grow onions in a greenhouse if you live in a hot climate. You can grow onions in a greenhouse if you live in a dry climate. You can grow onions in a greenhouse if you live in a wet climate.  ",
            "emoji": "😕"
        },
        "record-2": {
            "plant name": "pepper",
            "date": "Nov. 28th",
            "note": "it smells a little bit weird, need to change the soil type",
            "story1": "I like pepper because it is spicy. Peppers vary in size, shape, color, and heat. They can be green, red, yellow, orange, or purple. They can be round, oblong, or bell-shaped. They can be mild, medium, or hot. There are many different types of peppers. Some of the most common types of peppers are bell peppers, jalapeños, and habaneros. Bell peppers are the most common type of pepper. They are green, red, yellow, orange, or purple. They are round, oblong, or bell-shaped. They are mild, medium, or hot. ",
            "story2": "I started growing pepper in my garden. I planted the seeds in the spring. I watered the plants every day. I fertilized the plants every week. I harvested the peppers in the fall. I ate the peppers with my family. I ate the peppers with my friends. Pepper is good for your health. It is rich in vitamin C and vitamin B6. It is also rich in fiber, folate, and potassium. Pepper is good for your heart. It can help lower your blood pressure and cholesterol. Pepper is good for your eyes. It can help prevent cataracts and macular degeneration. Pepper is good for your skin. It can help prevent acne and wrinkles. Pepper is good for your immune system. ",
            "emoji": "🚀"
        },
        "record-3": {
            "plant name": "tomato",
            "date": "Nov. 29th",
            "note": "it smells a very good!",
            "story1": "Tomatoes are good for your health. They are rich in vitamin C and vitamin B6. They are also rich in fiber, folate, and potassium. Tomatoes are also good for your heart. They can help lower your blood pressure and cholesterol. Tomatoes are also good for your eyes. They can help prevent cataracts and macular degeneration. Tomatoes are also good for your skin. They can help prevent acne and wrinkles. Tomatoes are also good for your immune system. ",
            "story2": "I started growing tomato in my garden. I planted the seeds in the spring. I watered the plants every day. I fertilized the plants every week. I harvested the tomatoes in the fall. I ate the tomatoes with my family. I ate the tomatoes with my friends. Tomato is good for your health. It is rich in vitamin C and vitamin B6. It is also rich in fiber, folate, and potassium. Tomato is good for your heart. It can help lower your blood pressure and cholesterol. Tomato is good for your eyes. It can help prevent cataracts and macular degeneration. Tomato is good for your skin. It can help prevent acne and wrinkles. Tomato is good for your immune system. ",
            "emoji": "🍅"
        }
    },
    "345678": {
        "record-1": {
            "plant name": "apple",
            "date": "Nov. 29th",
            "note": "it smells a very good!",
            "story1": "",
            "story2": "I grow apple with love. An apple a day keeps the doctor away. I eat apple with peanut butter. I started to like gardening because of apple. I think growing my own apple is more interesting than going to apple picking. There are different types of apple. Some of the most common types of apple are Gala, Fuji, and Granny Smith. Gala is the most common type of apple. It is red, yellow, or green. It is round, oblong, or bell-shaped. It is mild, medium, or hot. ",
            "emoji": "😍"
        },
        "record-2": {
            "plant name": "blueberry",
            "date": "Nov. 30th",
            "note": "they are about to harvest!",
            "story1": "My first blueberry is about to harvest. I am so excited. I am going to eat it with my family. I am going to eat it with my friends. Blueberry is good for your health. It is rich in vitamin C and vitamin B6. It is also rich in fiber, folate, and potassium. Blueberry is good for your heart. It can help lower your blood pressure and cholesterol. Blueberry is good for your eyes. It can help prevent cataracts and macular degeneration. Blueberry is good for your skin. It can help prevent acne and wrinkles. Blueberry is good for your immune system. ",
            "story2": "Blueberry is the most common type of berry. It is red, yellow, or green. It is round, oblong, or bell-shaped. It is mild, medium, or hot. I like to eat blueberry with some yogurt. Blueberries are from North America. For beginners, I recommend growing blueberry. Blueberry is easy to grow. You need a lot of water and sunlight. You also need a lot of space. You can grow blueberry in your garden or in a pot. You can also grow blueberry in a greenhouse. You can grow blueberry in a greenhouse if you live in a cold climate. You can grow blueberry in a greenhouse if you live in a warm climate. You can grow blueberry in a greenhouse if you live in a hot climate. You can grow blueberry in a greenhouse if you live in a dry climate. You can grow blueberry in a greenhouse if you live in a wet climate.  ",
            "emoji": "❤️"
        },
        "record-3": {
            "plant name": "lemon",
            "date": "Dec. 1st",
            "note": "rainy day makes lemon grow slowly",
            "story1": "Lemon is very special to me. I like to eat lemon with some yogurt. Lemon is good for your health. It is rich in vitamin C and vitamin B6. It is also rich in fiber, folate, and potassium. Lemon is good for your heart. It can help lower your blood pressure and cholesterol. Lemon is good for your eyes. It can help prevent cataracts and macular degeneration. Lemon is good for your skin. It can help prevent acne and wrinkles. Lemon is good for your immune system. ",
            "story2": "Lemon are good for beginners. Lemon are easy to grow. You need a lot of water and sunlight. You also need a lot of space. You can grow lemon in your garden or in a pot. You can also grow lemon in a greenhouse. You can grow lemon in a greenhouse if you live in a cold climate. You can grow lemon in a greenhouse if you live in a warm climate. You can grow lemon in a greenhouse if you live in a hot climate. You can grow lemon in a greenhouse if you live in a dry climate. You can grow lemon in a greenhouse if you live in a wet climate.  ",
            "emoji": "🫡"
        }
    },
    "456789": {
        "record-1": {
            "plant name": "orange",
            "date": "Dec. 1st",
            "note": "feeling a sense of accomplishment while growing these oranges",
            "story1": "",
            "story2": "It is difficult to grow oranges. You need a lot of water and sunlight. You also need a lot of space. You can grow oranges in your garden or in a pot. You can also grow oranges in a greenhouse. You can grow oranges in a greenhouse if you live in a cold climate.  ",
            "emoji": "😙"
        },
        "record-2": {
            "plant name": "strawberry",
            "date": "Dec. 3rd",
            "note": "it takes more time to grow bigger",
            "story1": "Growing strawberry is not that hard. You just need to water them regularly and provide them with enough light. Before planting, till the soil to a depth of at least six inches to allow the strawberries to grow deep roots. Then, plant your strawberry seeds about an inch deep and two inches apart, in rows that are about a foot apart. Once your strawberry seeds have sprouted and the seedlings are about two inches tall, thin them out to one plant every four inches. This will give the remaining strawberries room to grow and develop.",
            "story2": "Strawberry is better when it is fresh. You can eat it with yogurt or ice cream. You can also eat it with milk. I like fresh taste of strawberry. Many strawberry farms are located in California. But you can also grow strawberry in your garden. Sometimes it is more sustainable and cheaper to grow strawberry in your garden. ",
            "emoji": "👍"
        },
        "record-3": {
            "plant name": "tomato",
            "date": "Oct. 30th",
            "note": "The tomatoes look nice, I want to plate them with fried eggs ><",
            "story1": "Tomato is best served with fried egg. I love the combination of tomato and fried egg. Here is how to make it. First, you need to fry the egg. Then, you need to cut the tomato into small pieces. Finally, you need to put the tomato and fried egg together. It is very easy to make. You can try it at home.",
            "story2": "Growing tomato is not that hard. You just need to water them regularly and provide them with enough light. Before planting, till the soil to a depth of at least six inches to allow the tomatoes to grow deep roots. Then, plant your tomato seeds about an inch deep and two inches apart, in rows that are about a foot apart. Once your tomato seeds have sprouted and the seedlings are about two inches tall, thin them out to one plant every four inches. This will give the remaining tomatoes room to grow and develop.",
            "emoji": "🎉"
        }
    }
}
